---
kind: method
id: M:Autodesk.Revit.DB.WorksharingDisplayGraphicSettings.Dispose
source: html/5c470551-dd56-fb62-40a6-0cb2d65b04b4.htm
---
# Autodesk.Revit.DB.WorksharingDisplayGraphicSettings.Dispose Method

Releases all resources used by the WorksharingDisplayGraphicSettings

## Syntax (C#)
```csharp
public void Dispose()
```